/*
 * PTra10_07.cs
 *   作成	Rhizome
 *------------------------------------------------------------
 * Copyright(c) Rhizome Inc. All Rights Reserved.
 */

using System;

public class PTra10_07
{
    /*
  	 * PTra10_05で作成したCarクラスを使用します
  	 */

    public static void Main(string[] args)
    {
        // 目的地までの距離
        const int DISTANCE = 300;

        /*
    	 * TODO carインスタンスを3件作成し、それぞれの色、ガソリンを以下のように設定してください。
    	 * 1台目：colorフィールドに"赤"、gasolineフィールドに50
    	 * 2台目：colorフィールドに"青"、gasolineフィールドに60
    	 * 3台目：colorフィールドに"黄"、gasolineフィールドに70
    	 *
    	 * 各carインスタンスメソッドRunを繰り返し使って、それぞれ目的地まで進んでください
    	 * 先にガソリンがなくなった場合は、「x色の車は、目的地に到達できませんでした」を出力してください
    	 * 目的地についた時点で「x色の車は、目的地にまでy時間かかりました。残りのガソリンは、zリットルです」を出力してください
    	 * ※ xは車の色、yはRunメソッドを実行した回数, zは残りのガソリンの数です
    	 * ※ クラス型配列を利用して処理を行なってください。
    	 */

    }
}
